#### CDKTF Diff 📋
<details><summary>Show Diff</summary>

```
route53_app1.kaercher.com  Initializing the backend...
route53_app1.kaercher.com  
                           Successfully configured the backend "s3"! Terraform will automatically
                           use this backend unless the backend configuration changes.
route53_app1.kaercher.com  Initializing provider plugins...
                           - Finding hashicorp/aws versions matching "5.45.0"...
route53_app1.kaercher.com  - Installing hashicorp/aws v5.45.0...
route53_app1.kaercher.com  - Installed hashicorp/aws v5.45.0 (signed by HashiCorp)
route53_app1.kaercher.com  Terraform has created a lock file .terraform.lock.hcl to record the provider
                           selections it made above. Include this file in your version control repository
                           so that Terraform can guarantee to make the same selections by default when
                           you run "terraform init" in the future.

                           Terraform has been successfully initialized!
                           
                           You may now begin working with Terraform. Try running "terraform plan" to see
                           any changes that are required for your infrastructure. All Terraform commands
                           should now work.

                           If you ever set or change modules or backend configuration for Terraform,
                           rerun this command to reinitialize your working directory. If you forget, other
                           commands will detect it and remind you to do so if necessary.
route53_app1.kaercher.com  - Fetching hashicorp/aws 5.45.0 for linux_amd64...
route53_app1.kaercher.com  - Retrieved hashicorp/aws 5.45.0 for linux_amd64 (signed by HashiCorp)
                           - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
route53_app1.kaercher.com  Success! Terraform has validated the lock file and found no need for changes.
route53_app1.kaercher.com  Terraform used the selected providers to generate the following execution
                           plan. Resource actions are indicated with the following symbols:
                             + create

                           Terraform will perform the following actions:
route53_app1.kaercher.com    # aws_route53_record._homeducloilocal_A (_home.ducloi.local_A) will be created
                             + resource "aws_route53_record" "_homeducloilocal_A" {
                                 + allow_overwrite = (known after apply)
                                 + fqdn            = (known after apply)
                                 + id              = (known after apply)
                                 + name            = "home.ducloi.local"
                                 + records         = [
                                     + "14.226.250.205",
                                   ]
                                 + ttl             = 86400
                                 + type            = "A"
                                 + zone_id         = "Z04310523PE6MMFQSSP6Z"
                               }

                           Plan: 1 to add, 0 to change, 0 to destroy.
                           
                           ─────────────────────────────────────────────────────────────────────────────

                           Saved the plan to: plan

                           To perform exactly these actions, run the following command to apply:
                               terraform apply "plan"


```

</details>

*Pusher: @bnguyenvan, Action: `pull_request`, Workflow: `CDKTF Plan`*